app/Controllers/Admin.php

    public function AddReward(){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
        $data = [];
        helper(['form']);

        if ($this->request->getMethod() == 'post') {
        //Validation
        $rules = [
          'rewardname' => 'required|min_length[5]|max_length[50]',
          'rewardimage' => 'uploaded[rewardimage]|is_image[rewardimage]|max_size[rewardimage,4000]',
        ];

        if (! $this->validate($rules)) {

          $data['validation'] = $this->validator;

        }else{

          //Storing user registration into database
          $model = new reward_model();

          $newData = [
            'RewardName' => $this->request->getVar('rewardname'),
            'RewardImage' => $this->request->getFile('rewardimage'),
            'RewardTier' => $this->request->getVar('rewardtier'),
          ];
          $Result = $model->save($newData);
---
SELECT *
FROM `admin`
WHERE `StaffId` = '5'
 LIMIT 1
INSERT INTO `reward` (`RewardName`, `RewardImage`, `RewardTier`) VALUES ('gggggggggggg', 'C:\\xampp\\tmp\\phpBE1C.tmp', '1')

    public function AddAdmin(){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '5'
 LIMIT 1