app/Controllers/Admin.php

    public function index()
    {
        if (session()->get('AdminisLoggedIn')){

          $StaffId = session('StaffId');
          $admin_model = new admin_model();
          $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
          // TotalToday's Revenue

          // Total Users
          $UserModel = new UserModel();
          $UsersData =  $UserModel->countAll();
          $data = array(
            'userData' => $UsersData,
          );
          // Total Revenue
          $paymentRev = new payment_model();
          $data['payment'] = $paymentRev->findAll();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '1'
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `payment`

    public function UsersTable()
    {
      if (session()->get('AdminisLoggedIn')){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();

        $UserModel = new UserModel();
        $data['usersTable'] = $UserModel->orderBy('id', 'ASC') ->findAll();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '5'
 LIMIT 1
SELECT *
FROM `users`
ORDER BY `id` ASC

    public function ProductsTable()
    {
      if (session()->get('AdminisLoggedIn')){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '1'
 LIMIT 1

    public function OrdersTable()
    {
      if (session()->get('AdminisLoggedIn')){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '9000'
 LIMIT 1

    public function PaymentsTable()
    {
      if (session()->get('AdminisLoggedIn')){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();

        $payment_model = new payment_model();
        $data['paymentsTable'] = $payment_model->orderBy('PaymentId', 'ASC') ->findAll();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '5'
 LIMIT 1
SELECT *
FROM `payment`
ORDER BY `PaymentId` ASC

    public function CPUsTable()
    {
      if (session()->get('AdminisLoggedIn')){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '5'
 LIMIT 1

    public function GPUsTable()
    {
      if (session()->get('AdminisLoggedIn')){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '1'
 LIMIT 1

    public function AddUser(){
      if (session()->get('AdminisLoggedIn')){

        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '5'
 LIMIT 1

    public function AddProduct(){
      if (session()->get('AdminisLoggedIn')){
        $StaffId = session('StaffId');
        $admin_model = new admin_model();
        $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '5'
 LIMIT 1

      public function ModifyUser(){
        if (session()->get('AdminisLoggedIn')){
          $StaffId = session('StaffId');
          $admin_model = new admin_model();
          $data1['adminData'] = $admin_model->where('StaffId', $StaffId)->first();
          $usersid = $this->request->getVar('userid');
          $UserModel = new UserModel();
          $data['viewuser'] = $UserModel->where('id', $usersid)->first();
---
SELECT *
FROM `admin`
WHERE `StaffId` = '1'
 LIMIT 1
SELECT *
FROM `users`
WHERE `id` = '1001'
 LIMIT 1