app/Controllers/Home.php

    public function index()
    {
      $product_model = new product_model();
      $promotion_model = new promotion_model();
      $data['product'] = $product_model->orderBy('ProductPrice', 'ASC')->first();
      $data['promotion'] = $promotion_model->orderBy('PromotionPrice', 'ASC')->first();
---
SELECT *
FROM `product`
ORDER BY `ProductPrice` ASC
 LIMIT 1
SELECT *
FROM `promotion`
ORDER BY `PromotionPrice` ASC
 LIMIT 1

    public function Login()
    {
      $data = [];
      helper(['form']);

          if ($this->request->getMethod() == 'post') {
            //Validation
            $rules = [
              'email' => 'required|min_length[6]|max_length[50]|valid_email',
              'password' => 'required|min_length[8]|max_length[255]|validateUser[email,password]',
            ];

            $errors = [
              'password' => [
                'validateUser' => 'Email or Password don\'t match'
              ]
            ];

            if (! $this->validate($rules, $errors)) {
              $data['validation'] = $this->validator;
            }else{
              $model = new UserModel();

              $user = $model->where('email', $this->request->getVar('email'))
                            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'darshendran@gmail.com'
 LIMIT 1

    public function Build_PC()
    {
      $component_model = new component_model();
      $data['component'] = $component_model->orderBy('ComponentId', 'ASC') ->findAll();
---
SELECT *
FROM `component`
ORDER BY `ComponentId` ASC

    public function Products()
    {
      $product_model = new product_model();
      $data['product'] = $product_model->orderBy('CreatedOn', 'DESC') ->findAll();
---
SELECT *
FROM `product`
ORDER BY `CreatedOn` DESC

    public function PromotionDetails($PromotionId = null){
      $promotion_model = new promotion_model();
      $data['promotion'] = $promotion_model->where('PromotionId', $PromotionId)->first();
---
SELECT *
FROM `promotion`
WHERE `PromotionId` = '2'
 LIMIT 1

public function AddCart1($ProductId){

  if (session()->get('isLoggedIn')){
      $id = session('id');
      $product_model = new product_model();
      $data['product'] = $product_model->where('ProductId', $ProductId)->findAll();
      $productCartitem = $data['product'];


        $cart_model = new cart_model();
        $array = ['uid' => $id, 'ProductId' => $ProductId];
        $data['cart'] = $cart_model->where($array)->findAll();
---
SELECT *
FROM `product`
WHERE `ProductId` = '1003'
SELECT *
FROM `cart`
WHERE `uid` = '14'
AND `ProductId` = '1003'

      public function AccountManagement()
      {
        $id = session('id');
        $usermodel = new UserModel();
        $data['users'] = $usermodel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '14'
 LIMIT 1