app/Controllers/Home.php

SELECT *
FROM `product`
WHERE `ProductId` = '1001'
---
    public function AddCart1($ProductId)
    {
        // Product
        if (session()->get('isLoggedIn'))
        {
            $id = session('id');
            $product_model = new product_model();
            $data['product'] = $product_model->where('ProductId', $ProductId)->findAll();

SELECT *
FROM `cart`
WHERE `uid` = '14'
---
    public function AddCart2($PromotionId)
    {
        // Promotion
        if (session()->get('isLoggedIn'))
        {
            $id = session('id');
            $promotion_model = new promotion_model();
            $data['promotion'] = $promotion_model->where('PromotionId', $PromotionId)->findAll();
            $promotionCartitem = $data['promotion'];

            $cart_model = new cart_model();
            $array = ['uid' => $id, 'PromotionId' => $PromotionId];
            $data['cart'] = $cart_model->where($array)->findAll();
            $cart = $data['cart'];

            $NumberOfCartItem = count($cart);

            if ($NumberOfCartItem > 0)
            {
                foreach ($cart as $cart)
                {

                    $array = ['uid' => $id, 'PromotionId' => $PromotionId];
                    $data['updateCart'] = $cart_model->where($array)->findAll();

SELECT *
FROM `cart`
WHERE `uid` = '1000'
---
    public function Cart()
    {
        $id = session('id');
        $cart_model = new cart_model();
        $data['cart'] = $cart_model->where('uid', $id)->findAll();

SELECT *
FROM `reward`
WHERE `RewardTier` = '1'
 LIMIT 1
SELECT *
FROM `reward`
WHERE `RewardTier` = '2'
 LIMIT 1
SELECT *
FROM `reward`
WHERE `RewardTier` = '3'
 LIMIT 1
---
    public function Game()
    {
      if (session()->get('AbleToPlayGame')) {
        $reward_model = new reward_model();
        $data['rewardTier1'] = $reward_model->where('RewardTier', '1')
            ->first();
        $data['rewardTier2'] = $reward_model->where('RewardTier', '2')
            ->first();
        $data['rewardTier3'] = $reward_model->where('RewardTier', '3')
            ->first();